#!/bin/sh


dostr()
{
  echo    "          UTF-8: $1"
  echo -n '       squoze-6: ' ; ./squoze5 -e -6 "$1"
  echo -n '      squoze-10: ' ; ./squoze5 -e -10 "$1"
  echo -n '      squoze-12: ' ; ./squoze5 -e -12 "$1"
  echo -n 'squoze-5 base64: ' ; ./squoze5 -v -e --base64 "$1"
  echo -n '   UTF-8 base64: ' ; echo -n "$1" | base64 --wrap=0 ; echo
  echo -n '       squoze-5: ' ; ./squoze5 -ev "$1"
  echo -n '          UTF-5: ' ; ./squoze5 -e --utf5 "$1"
  echo ""
}

for a in  \
'foo' \
'foobar' \
'foo bar' \
'Foo' \
'FOO' \
'bar' \
'hello' \
'world' \
'hello world' \
'Hello' \
'World' \
'Hello World' \
'Hello World!' \
"᚛᚛ᚉᚑᚅᚔᚉᚉᚔᚋ ᚔᚈᚔ ᚍᚂᚐᚅᚑ ᚅᚔᚋᚌᚓᚅᚐ᚜" \
"𐌼𐌰𐌲 𐌲𐌻𐌴𐍃 𐌹̈𐍄𐌰𐌽, 𐌽𐌹 𐌼𐌹𐍃 𐍅𐌿 𐌽𐌳𐌰𐌽 𐌱𐍂𐌹𐌲𐌲𐌹𐌸." \
"جام ييه بلورم بڭا ضررى طوقونمز" \
"Алам да бар, пыяла, әмма бу ранит мине." \
"আমি কাঁচ খেতে পারি, তাতে আমার কোনো ক্ষতি হয় না।" \
"मी काच खाऊ शकतो, मला ते दुखत नाही." \
"ನನಗೆ ಹಾನಿ ಆಗದೆ, ನಾನು ಗಜನ್ನು ತಿನಬಹುದು" \
"मैं काँच खा सकता हूँ और मुझे उससे कोई चोट नहीं पहुंचती." \
"എനിക്ക് ഗ്ലാസ് തിന്നാം. അതെന്നെ വേദനിപ്പിക്കില്ല." \
"நான் கண்ணாடி சாப்பிடுவேன், அதனால் எனக்கு ஒரு கேடும் வராது." \
"నేను గాజు తినగలను మరియు అలా చేసినా నాకు ఏమి ఇబ్బంది లేదు" \
"මට වීදුරු කෑමට හැකියි. එයින් මට කිසි හානියක් සිදු නොවේ." \
"میں کانچ کھا سکتا ہوں اور مجھے تکلیف نہیں ہوتی ۔" \
"زه شيشه خوړلې شم، هغه ما نه خوږوي" \
".من می توانم بدونِ احساس درد شيشه بخورم" \
"أنا قادر على أكل الزجاج و هذا لا يؤلمني." \
"Nista' niekol il-ħġieġ u ma jagħmilli xejn." \
"אני יכול לאכול זכוכית וזה לא מזיק לי." \
"איך קען עסן גלאָז און עס טוט מיר נישט װײ." \
"က္ယ္ဝန္‌တော္‌၊က္ယ္ဝန္‌မ မ္ယက္‌စားနုိင္‌သည္‌။ ၎က္ရောင္‌့ ထိခုိက္‌မ္ဟု မရ္ဟိပာ။ (9)" \
"ကျွန်တော် ကျွန်မ မှန်စားနိုင်တယ်။ ၎င်းကြောင့် ထိခိုက်မှုမရှိပါ။ (9)" \
"Tôi có thể ăn thủy tinh mà không hại gì." \
"些 𣎏 世 咹 水 晶 𦓡 空 𣎏 害 咦" \
"ខ្ញុំអាចញុំកញ្ចក់បាន ដោយគ្មានបញ្ហារ" \
"ຂອ້ຍກິນແກ້ວໄດ້ໂດຍທີ່ມັນບໍ່ໄດ້ເຮັດໃຫ້ຂອ້ຍເຈັບ." \
"ฉันกินกระจกได้ แต่มันไม่ทำให้ฉันเจ็บ" \
"ᠪᠢ ᠰᠢᠯᠢ ᠢᠳᠡᠶᠦ ᠴᠢᠳᠠᠨᠠ ᠂ ᠨᠠᠳᠤᠷ ᠬᠣᠤᠷᠠᠳᠠᠢ ᠪᠢᠰᠢ" \
"﻿म काँच खान सक्छू र मलाई केहि नी हुन्‍न् ।" \
"ཤེལ་སྒོ་ཟ་ནས་ང་ན་གི་མ་རེད།" \
"我能吞下玻璃而不傷身體。" \
"Góa ē-tàng chia̍h po-lê, mā bē tio̍h-siong." \
"私はガラスを食べられます。それは私を傷つけません。" \
"나는 유리를 먹을 수 있어요. 그래도 아프지 않아요" \
"ᐊᓕᒍᖅ ᓂᕆᔭᕌᖓᒃᑯ ᓱᕋᙱᑦᑐᓐᓇᖅᑐᖓ" \
"Tsésǫʼ yishą́ągo bííníshghah dóó doo shił neezgai da." \
"Ljœr ye caudran créneþ ý jor cẃran. " \
"ᛖᚴ ᚷᛖᛏ ᛖᛏᛁ ᚧ ᚷᛚᛖᚱ ᛘᚾ ᚦᛖᛋᛋ ᚨᚧ ᚡᛖ ᚱᚧᚨ ᛋᚨᚱ" \
"Ek get etið gler án þess að verða sár." \
"Я могу есть стекло, оно мне не вредит." \
"ﺄﻧﺍ ﻕﺍﺩﺭ ﻊﻟﻯ ﺄﻜﻟ ﺎﻟﺰﺟﺎﺟ ﻭ ﻩﺫﺍ ﻻ ﻱﺆﻠﻤﻨﻳ." \
"我能吞下玻璃而不伤身体。" \
"私はガラスを食べられます。それは私を傷つけません。" \
"ฉันกินกระจกได้ แต่มันไม่ทำให้ฉันเจ็บ" \
"אני יכול לאכול זכוכית וזה לא מזיק לי." \
"मैं काँच खा सकता हूँ और मुझे उससे कोई चोट नहीं पहुंचती." \
"ﺝﺎﻣ ﻲﻴﻫ ﺐﻟﻭﺮﻣ ﺏڭﺍ ﺽﺭﺭﻯ ﻁﻮﻗﻮﻨﻣﺯ" \
"Կրնամ ապակի ուտել և ինծի անհանգիստ չըներ։" \
"მინას ვჭამ და არა მტკივა." \
"Ich kann Glas essen, ohne mir zu schaden." \
"Ég get etið gler án þess að meiða mig." \
"Eg kan eta glas utan å skada meg." \
"⠊⠀⠉⠁⠝⠀⠑⠁⠞⠀⠛⠇⠁⠎⠎⠀⠁⠝⠙⠀⠊⠞⠀⠙⠕⠑⠎⠝⠞⠀⠓⠥⠗⠞⠀⠍⠑" \
"I can eat glass and it doesn't hurt me." \
"Μπορώ να φάω σπασμένα γυαλιά χωρίς να πάθω τίποτα." \
"ὕαλον ϕαγεῖν δύναμαι· τοῦτο οὔ με βλάπτει." \
"काचं शक्नोम्यत्तुम् । नोपहिनस्ति माम् ॥" \
"“Moscow” is Москва." \
"foo
foo
foo
foo" \
"hello this
is a longer
multiline test" \
; do dostr "$a";done
